Revit 2027 API
BuiltInFailures.EditingFailures.PinnedObjectNotDeleted Property
 Pinned objects were not deleted. To delete them, unpin them before using delete.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId PinnedObjectNotDeleted { get; }
Public Shared ReadOnly Property PinnedObjectNotDeleted As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ PinnedObjectNotDeleted {
	FailureDefinitionId^ get ();
}
static member PinnedObjectNotDeleted : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace